# BuiltInFailures.SlabShapeFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SlabShapeFailures Class
BuiltInFailures Class Members See Also
---
Failures about SlabShape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SlabShapeFailures
```

Visual Basic
---
```text
Public NotInheritable Class SlabShapeFailures
```

Visual C++
---
```text
public ref class SlabShapeFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SlabShapeFailures
# See Also
BuiltInFailures..::..SlabShapeFailures Members
Autodesk.Revit.DB Namespace